<template>
	<div class="text">
		<div class="container text__content">
			<p v-html="content"></p>
			<img src="../assets/img/maldives-1.jpg" alt="" srcset="../assets/img/maldives-1@2x.jpg 2x">
			<p v-html="content"></p>
			<p v-html="content1"></p>
		</div>
	</div>
</template>

<script>

// @ is an alias to /src
export default {
	name: "textBlock",
	data: function () {
		return {
			image: 'maldives-1',
			content: 'Национальная кухня Мальдивских островов испытала на&nbsp;себя влияние арабской и&nbsp;индийской культур. В&nbsp;ее&nbsp;основе лежат три базовых ингредиента: рис, морская рыба и&nbsp;кокосовый орех. Очень популярен карри. В&nbsp;качестве десерта идут белые кокосовые палочки (здесь их&nbsp;называют &laquo;бонди&raquo;) и&nbsp;фруктовые салаты. Самый популярный на&nbsp;островах напиток&nbsp;&mdash; зеленый чай в&nbsp;сочетании с&nbsp;большим количеством молока и&nbsp;сахара.',
			content1: 'В первую очередь на Мальдивы едут, конечно же, за пляжным отдыхом. Возможностей для него здесь предостаточно – к вашим услугам белые песчаные пляжи и голубое небо. Для пар, желающих максимальной релаксации, открыты двери мальдивских спа-салонов. При отелях есть свои спа-центры, <blockquote class="quote__left">Мальдивы — это цепь из 26 атоллов, которые состоят из более тысячи коралловых островов. Многие из островов необитаемы и по сей день.</blockquote> каждый из которых обладает своими особенностями: спа на пляже, в тропическому лесу или подводный спа, лежа в котором можно наслаждаться панорамными видами океана. Детям же будет интересно посетить морской заповедник Ханифару Бэй. </br></br>Самым популярным развлечением на Мальдивах уже долгие года остается дайвинг. Видимость в удивительно прозрачной океанической воде достигает 50 метров! Специально для дайверов рекомендуется посетить атолл Южный Мале, на котором расположены морские заповедники, подводные пещеры и затонувшие суда. достигает 50 метров! Специально для дайверов рекомендуется посетить атолл Южный Мале, на котором расположены морские заповедники, подводные пещеры и затонувшие суда.'
		}
	}
};
</script>
<style lang="scss" scoped>
@import '@/assets/styles/_responsive.scss';

.text {
	padding: vw(95) 0 vw(90);

	&__content {
		margin: auto;
	
		> p {
			font-size: vw(18);
			color: rgb(51, 51, 51);
			line-height: 1.667;
			margin: 0 0;

			&:not(:last-child) {
				margin: 0 0 vw(90);
			}
		}

		blockquote {
			font-size: vw(30);
			color: rgb(51, 51, 51);
			font-weight: bold;
			font-style: italic;
			line-height: 1.333;
		}

		> img {
			width: 100%;
			margin: 0 0;
			display: block;

			&:not(:last-child) {
				margin: 0 0 vw(95);
			}
		}
	}
}
</style>
